tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "supabase/tap"
brew "atuin"
brew "bash"
brew "ca-certificates"
brew "bat"
brew "cabal-install"
brew "coreutils"
brew "curl"
brew "direnv"
brew "docker"
brew "elixir"
brew "elixir-ls"
brew "elm"
brew "erlang_ls"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghcup"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gleam"
brew "go"
brew "google-java-format"
brew "gopls"
brew "gradle"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "maven"
brew "mongosh"
brew "mysql"
brew "mysql-client"
brew "neovim"
brew "nushell"
brew "nvm"
brew "ripgrep"
brew "opencode"
brew "openssh"
brew "pipx"
brew "poetry"
brew "pyenv"
brew "sops"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "autodesk-fusion"
cask "claude"
cask "creality-print"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-ocr"
cask "hiddenbar"
cask "intellij-idea-ce"
cask "kicad"
cask "maccy"
cask "mongodb-compass"
cask "nordvpn"
cask "nvidia-geforce-now"
cask "obsidian"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quickjson"
cask "raycast"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "DaVinci Resolve", id: 571213070
mas "Magnet", id: 441258766
mas "Tailscale", id: 1475387142
mas "Vimlike", id: 1584519802
mas "Xcode", id: 497799835
vscode "4ops.terraform"
vscode "a-h.templ"
vscode "anthropic.claude-code"
vscode "ban.spellright"
vscode "chakrounanas.turbo-console-log"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "elmtooling.elm-ls-vscode"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "github.remotehub"
vscode "gleam.gleam"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "jakebecker.elixir-ls"
vscode "juanallo.vscode-dependency-cruiser"
vscode "mechatroner.rainbow-csv"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "natqe.reload"
vscode "nhoizey.gremlins"
vscode "otovo-oss.htmx-tags"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-yaml"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
go "honnef.co/go/tools/cmd/staticcheck"
