brew "ffmpeg"
brew "hugo"
brew "yt-dlp"
cask "autodesk-fusion"
cask "creality-print"
cask "kicad"
cask "nvidia-geforce-now"
cask "nordvpn"
cask "obsidian"
cask "spotify"
cask "steam"
cask "whatsapp"
mas "DaVinci Resolve", id: 571213070
mas "Tailscale", id: 1475387142
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
